Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/billv-ca/homelab-atlantis-k3s-base-services/34/default/default.tfplan"' in '/atlantis-data/repos/billv-ca/homelab-atlantis-k3s-base-services/34/default': exit status 1
module.atlantis.kubernetes_cluster_role_binding_v1.atlantis-admin: Refreshing state... [id=atlantis-cluster-admin]
kubernetes_secret_v1.bill_token: Refreshing state... [id=default/bill-token]
module.atlantis.kubernetes_namespace_v1.namespace: Refreshing state... [id=atlantis-system]
module.pihole_system.data.kubernetes_service_v1.traefik: Reading...
module.pihole_system.data.kubernetes_service_v1.traefik: Read complete after 0s [id=kube-system/traefik]
module.omada_controller.kubernetes_namespace_v1.omada_controller: Refreshing state... [id=omada-controller]
module.dashboard.kubernetes_namespace_v1.kube_dashboard: Refreshing state... [id=kubernetes-dashboard]
module.authentik_system.random_password.postgresql_password: Refreshing state... [id=none]
module.traefik_config.kubernetes_manifest.traefik_entrypoints: Refreshing state...
module.cert-manager.kubernetes_manifest.namespace_cert_manager: Refreshing state...
module.metallb-system.kubernetes_manifest.namespace_metallb_system: Refreshing state...
module.authentik_system.kubernetes_manifest.ingressroute: Refreshing state...
module.longhorn_system.kubernetes_manifest.recurringjob_longhorn_system_daily_backup: Refreshing state...
module.pihole_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.pihole_system.kubernetes_manifest.ingressroute: Refreshing state...
module.pihole_system.kubernetes_manifest.assistant_ingressroute: Refreshing state...
module.authentik_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.longhorn_system.kubernetes_namespace.longhorn_system: Refreshing state... [id=longhorn-system]
module.pihole_system.kubernetes_manifest.middleware_admin: Refreshing state...
module.authentik_system.random_password.authentik_secret_key: Refreshing state... [id=none]
module.pihole_system.kubernetes_manifest.certificate_piholeassistant_billv_ca: Refreshing state...
module.authentik_system.random_password.akadmin_password: Refreshing state... [id=none]
kubernetes_service_account_v1.bill: Refreshing state... [id=default/bill]
module.k8s_amd_gpu.helm_release.k8s-device-plugin: Refreshing state... [id=amd-gpu]
module.authentik_system.random_password.authentik_api_key: Refreshing state... [id=none]
module.pihole_system.helm_release.pihole: Refreshing state... [id=pihole]
module.pihole_system.kubernetes_manifest.middleware_ipallowlist: Refreshing state...
module.authentik_system.kubernetes_manifest.certificate_authentik_auth_billv_ca: Refreshing state...
module.atlantis.kubernetes_manifest.ingressroute: Refreshing state...
module.omada_controller.kubernetes_manifest.ingressroute: Refreshing state...
module.atlantis.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.omada_controller.kubernetes_manifest.certificate_authentik_omada_billv_ca: Refreshing state...
module.omada_controller.kubernetes_manifest.servers_transport: Refreshing state...
module.omada_controller.kubernetes_stateful_set_v1.omada: Refreshing state... [id=omada-controller/omada-controller]
module.omada_controller.kubernetes_service_v1.omada_controller: Refreshing state... [id=omada-controller/omada-controller]
module.dashboard.kubernetes_manifest.servers_transport: Refreshing state...
module.dashboard.kubernetes_manifest.certificate_kube_billv_ca: Refreshing state...
module.dashboard.kubernetes_manifest.ingressroute: Refreshing state...
module.dashboard.helm_release.kube-dashboard: Refreshing state... [id=kubernetes-dashboard]
module.longhorn_system.aws_iam_user.longhorn: Refreshing state... [id=longhorn]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Reading...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Reading...
module.authentik_system.data.aws_ssm_parameter.smtp: Reading...
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Read complete after 0s [id=/runatlantis/webhook-secret]
module.atlantis.data.aws_ssm_parameter.proxmox-password: Reading...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Read complete after 0s [id=/runatlantis/key]
module.authentik_system.data.aws_ssm_parameter.smtp: Read complete after 0s [id=zoho-smtp-creds]
module.atlantis.aws_iam_user.atlantis: Refreshing state... [id=atlantis]
module.longhorn_system.aws_s3_bucket.longhorn_backups: Refreshing state... [id=longhorn-backups.billv.ca]
module.atlantis.data.aws_ssm_parameter.proxmox-password: Read complete after 0s [id=proxmox-ve-password]
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_challenges: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_certificates: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_orders: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_certificatesigningrequests: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_issuers: Refreshing state...
module.cert-manager.kubernetes_manifest.role_kube_system_cert_manager_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_orders: Refreshing state...
module.cert-manager.kubernetes_manifest.role_cert_manager_cert_manager_webhook_dynamic_serving: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_kube_system_cert_manager_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_webhook_subjectaccessreviews: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.mutatingwebhookconfiguration_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_challenges_acme_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_clusterissuers: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_orders_acme_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.validatingwebhookconfiguration_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_issuers_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_issuers: Refreshing state...
module.metallb-system.kubernetes_manifest.serviceaccount_metallb_system_controller: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_cluster_view: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_webhook_subjectaccessreviews: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_cert_manager_cert_manager_cert_manager_tokenrequest: Refreshing state...
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_clusterissuers: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_kube_system_cert_manager_cainjector_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_approve_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_ingress_shim: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_challenges: Refreshing state...
module.cert-manager.kubernetes_manifest.role_kube_system_cert_manager_cainjector_leaderelection: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bfdprofiles_metallb_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_certificates: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_certificatesigningrequests: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_view: Refreshing state...
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_edit: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_certificaterequests_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_ingress_shim: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_clusterissuers_cert_manager_io: Refreshing state...
module.metallb-system.kubernetes_manifest.configmap_metallb_system_metallb_excludel2: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrolebinding_metallb_system_controller: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_approve_cert_manager_io: Refreshing state...
module.metallb-system.kubernetes_manifest.secret_metallb_system_metallb_webhook_cert: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_cert_manager_cert_manager_webhook_dynamic_serving: Refreshing state...
module.cert-manager.kubernetes_manifest.role_cert_manager_cert_manager_tokenrequest: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_certificates_cert_manager_io: Refreshing state...
module.metallb-system.kubernetes_manifest.role_metallb_system_pod_lister: Refreshing state...
module.metallb-system.kubernetes_manifest.rolebinding_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.validatingwebhookconfiguration_metallb_webhook_configuration: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrole_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrole_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.deployment_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.service_metallb_system_metallb_webhook_service: Refreshing state...
module.metallb-system.kubernetes_manifest.role_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_communities_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.rolebinding_metallb_system_pod_lister: Refreshing state...
module.metallb-system.kubernetes_manifest.daemonset_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_l2advertisements_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bgpadvertisements_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_servicel2statuses_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bgppeers_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_ipaddresspools_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.serviceaccount_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrolebinding_metallb_system_speaker: Refreshing state...
module.longhorn_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.longhorn_system.kubernetes_manifest.ingressroute: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager_cainjector: Refreshing state...
kubernetes_cluster_role_binding.admin: Refreshing state... [id=bill]
module.authentik_system.aws_ssm_parameter.authentik-api-key: Refreshing state... [id=authentik-api-key]
module.authentik_system.kubernetes_secret_v1.worker-env: Refreshing state... [id=authentik/worker-env]
module.longhorn_system.aws_iam_access_key.longhorn: Refreshing state... [id=AKIAVZNMUHPERK6WFX6X]
module.authentik_system.helm_release.authentik: Refreshing state... [id=authentik]
module.atlantis.kubernetes_secret_v1.proxmox_password: Refreshing state... [id=atlantis-system/proxmox-password]
module.atlantis.aws_iam_user_policy.atlantis: Refreshing state... [id=atlantis:atlantis]
module.atlantis.aws_iam_access_key.atlantis: Refreshing state... [id=AKIAVZNMUHPEW45GPNH2]
module.longhorn_system.aws_iam_user_policy.s3: Refreshing state... [id=longhorn:longhorn-s3]
module.longhorn_system.kubernetes_secret_v1.longhorn_backups_credentials: Refreshing state... [id=longhorn-system/longhorn-backups-credentials]
module.atlantis.helm_release.atlantis: Refreshing state... [id=runatlantis]
module.atlantis.kubernetes_secret_v1.authentik_api_key: Refreshing state... [id=atlantis-system/authentik-api-key]
module.longhorn_system.helm_release.longhorn: Refreshing state... [id=longhorn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.atlantis.aws_iam_user_policy.atlantis will be updated in-place
  ~ resource "aws_iam_user_policy" "atlantis" {
        id          = "atlantis:atlantis"
        name        = "atlantis"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:Get*",
                            "s3:ListBucket",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::tfstate.billv.ca",
                            "arn:aws:s3:::tfstate.billv.ca/*",
                            "arn:aws:s3:::longhorn-backups.billv.ca",
                            "arn:aws:s3:::longhorn-backups.billv.ca/*",
                        ]
                        Sid      = "GrantAtlantisS3Access"
                    },
                  ~ {
                      ~ Resource = [
                            "arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/webhook-secret",
                          - "arn:aws:ssm:us-east-1:398183381961:parameter/authentik-api-key",
                            "arn:aws:ssm:us-east-1:398183381961:parameter/zoho-smtp-creds",
                            # (2 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "iam:GetUser",
                            "iam:GetUserPolicy",
                            "iam:ListAccessKeys",
                            "iam:GetSAMLProvider",
                            "iam:ListPolicies",
                            "iam:GetPolicy",
                            "iam:GetRole",
                            "iam:ListRolePolicies",
                            "iam:GetPolicyVersion",
                            "iam:ListAttachedRolePolicies",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:iam::398183381961:user/system/*",
                            "arn:aws:iam::398183381961:saml-provider/Authentik3s",
                            "arn:aws:iam::398183381961:role/Authentik-SAML-Admin",
                            "arn:aws:iam::*:policy/*",
                        ]
                        Sid      = "GrantAtlantisIAMAccess"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.authentik_system.data.kubernetes_service_v1.authentik_server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service_v1" "authentik_server" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "authentik-server"
          + namespace        = "authentik"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.authentik_system.helm_release.authentik will be updated in-place
  ~ resource "helm_release" "authentik" {
      ~ id                         = "authentik" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "2025.8.2" -> (known after apply)
          ~ chart          = "authentik" -> (known after apply)
          ~ first_deployed = 1758048573 -> (known after apply)
          ~ last_deployed  = 1758051574 -> (known after apply)
          ~ name           = "authentik" -> (known after apply)
          ~ namespace      = "authentik" -> (known after apply)
          ~ notes          = <<-EOT
                CHART NAME: postgresql
                CHART VERSION: 16.7.26
                APP VERSION: 17.6.0
                
                ⚠ WARNING: Since August 28th, 2025, only a limited subset of images/charts are available for free.
                    Subscribe to Bitnami Secure Images to receive continued support and security updates.
                    More info at https://bitnami.com and https://github.com/bitnami/containers/issues/83267
                
                ** Please be patient while the chart is being deployed **
                
                PostgreSQL can be accessed via port 5432 on the following DNS names from within your cluster:
                
                    authentik-postgresql.authentik.svc.cluster.local - Read/Write connection
                
                To get the password for "postgres" run:
                
                    export POSTGRES_ADMIN_PASSWORD=$(kubectl get secret --namespace authentik authentik-postgresql -o jsonpath="{.data.postgres-password}" | base64 -d)
                
                To get the password for "authentik" run:
                
                    export POSTGRES_PASSWORD=$(kubectl get secret --namespace authentik authentik-postgresql -o jsonpath="{.data.password}" | base64 -d)
                
                To connect to your database run the following command:
                
                    kubectl run authentik-postgresql-client --rm --tty -i --restart='Never' --namespace authentik --image docker.io/library/postgres:17.6-bookworm --env="PGPASSWORD=$POSTGRES_PASSWORD" \
                      --command -- psql --host authentik-postgresql -U authentik -d authentik -p 5432
                
                    > NOTE: If you access the container using bash, make sure that you execute "/opt/bitnami/scripts/postgresql/entrypoint.sh /bin/bash" in order to avoid the error "psql: local user with ID 1001} does not exist"
                
                To connect to your database from outside the cluster execute the following commands:
                
                    kubectl port-forward --namespace authentik svc/authentik-postgresql 5432:5432 &
                    PGPASSWORD="$POSTGRES_PASSWORD" psql --host 127.0.0.1 -U authentik -d authentik -p 5432
                
                WARNING: The configured password will be ignored on new installation in case when previous PostgreSQL release was deleted through the helm command. In that case, old PVC will have an old password, and setting it through helm won't take effect. Deleting persistent volumes (PVs) will solve the issue.
                
                WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                  - primary.resources
                  - readReplicas.resources
                +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                
                ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                
                Substituted images detected:
                  - docker.io/library/postgres:17.6-bookworm
                
                ⚠ SECURITY WARNING: Verifying original container images was skipped. Please note this Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Bitnami Secure Images containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                
                
                CHART NAME: redis
                CHART VERSION: 22.0.4
                APP VERSION: 8.2.1
                
                ⚠ WARNING: Since August 28th, 2025, only a limited subset of images/charts are available for free.
                    Subscribe to Bitnami Secure Images to receive continued support and security updates.
                    More info at https://bitnami.com and https://github.com/bitnami/containers/issues/83267
                
                ** Please be patient while the chart is being deployed **
                
                Redis&reg; can be accessed via port 6379 on the following DNS name from within your cluster:
                
                    authentik-redis-master.authentik.svc.cluster.local
                
                
                
                To connect to your Redis&reg; server:
                
                1. Run a Redis&reg; pod that you can use as a client:
                
                   kubectl run --namespace authentik redis-client --restart='Never'  --image docker.io/library/redis:8.2.1 --command -- sleep infinity
                
                   Use the following command to attach to the pod:
                
                   kubectl exec --tty -i redis-client \
                   --namespace authentik -- bash
                
                2. Connect using the Redis&reg; CLI:
                   redis-cli -h authentik-redis-master
                
                To connect to your database from outside the cluster execute the following commands:
                
                    kubectl port-forward --namespace authentik svc/authentik-redis-master 6379:6379 &
                    redis-cli -h 127.0.0.1 -p 6379
                
                WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                  - replica.resources
                  - master.resources
                +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                
                ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                
                Substituted images detected:
                  - docker.io/library/redis:8.2.1
                
                ⚠ SECURITY WARNING: Verifying original container images was skipped. Please note this Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Bitnami Secure Images containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                
                
                Run the commands below to get a kubeconfig file for authentik:
                
                KUBE_API=$(kubectl config view --minify --output jsonpath="{.clusters[*].cluster.server}")
                NAMESPACE=authentik
                SECRET_NAME=$(kubectl get serviceaccount authentik -o jsonpath='{.secrets[0].name}' 2>/dev/null || echo -n "authentik")
                KUBE_CA=$(kubectl -n $NAMESPACE get secret/$SECRET_NAME -o jsonpath='{.data.ca\.crt}')
                KUBE_TOKEN=$(kubectl -n $NAMESPACE get secret/$SECRET_NAME -o jsonpath='{.data.token}' | base64 --decode)
                
                echo "apiVersion: v1
                kind: Config
                clusters:
                - name: default-cluster
                  cluster:
                    certificate-authority-data: ${KUBE_CA}
                    server: ${KUBE_API}
                contexts:
                - name: default-context
                  context:
                    cluster: default-cluster
                    namespace: $NAMESPACE
                    user: authentik-user
                current-context: default-context
                users:
                - name: authentik-user
                  user:
                    token: ${KUBE_TOKEN}"
            EOT -> (known after apply)
          ~ revision       = 3 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - authentik  = {
                      - email           = {
                          - from     = "Authentik <bill@vandenberk.me>"
                          - host     = "smtp.zoho.com"
                          - password = "(sensitive value)"
                          - port     = 465
                          - timeout  = 10
                          - use_ssl  = true
                          - use_tls  = false
                          - username = "bill@vandenberk.me"
                        }
                      - error_reporting = {
                          - enabled = true
                        }
                      - postgresql      = {
                          - password = "(sensitive value)"
                        }
                      - secret_key      = "(sensitive value)"
                    }
                  - postgresql = {
                      - auth    = {
                          - password = "(sensitive value)"
                        }
                      - enabled = true
                      - primary = {
                          - persistence = {
                              - storageClass = "longhorn"
                            }
                        }
                    }
                  - redis      = {
                      - enabled = true
                      - primary = {
                          - persistence = {
                              - storageClass = "longhorn"
                            }
                        }
                    }
                  - server     = {
                      - ingress = {
                          - enabled = false
                        }
                    }
                  - worker     = {
                      - env     = [
                          - {
                              - name  = "AUTHENTIK_BOOTSTRAP_EMAIL"
                              - value = "bill@vandenberk.me"
                            },
                        ]
                      - envFrom = [
                          - {
                              - secretRef = {
                                  - name = "worker-env"
                                }
                            },
                        ]
                    }
                }
            ) -> (known after apply)
          ~ version        = "2025.8.2" -> (known after apply)
        } -> (known after apply)
        name                       = "authentik"
      ~ version                    = "2025.8.2" -> "2025.8.3"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
╷
│ Error: reading SSM Parameter (authentik-api-key): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 5f39c5b0-b1e4-4931-bf7f-790770273beb, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/authentik-api-key because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.authentik_system.aws_ssm_parameter.authentik-api-key,
│   on modules/authentik-system/main.tf line 34, in resource "aws_ssm_parameter" "authentik-api-key":
│   34: resource "aws_ssm_parameter" "authentik-api-key" {
│ 
╵


```
</details>